Repository: Jahn08/language_cards
Catalog: lib/l10n/app_*.arb
Languages: ru

# barScaffoldSettingsPanelTitle
source: Settings
ru: Настройки

# barScaffoldSettingsPanelLanguageSectionLabel
source: Language
ru: Язык

# barScaffoldSettingsPanelThemeSectionLabel
source: Theme
ru: Тема

# barScaffoldSettingsPanelStudySectionLabel
source: Study
ru: Учёба

# barScaffoldSettingsPanelStudySectionSortingCardOptionLabel
source: Card Sorting
ru: Сортировка карточек

# barScaffoldSettingsPanelStudySectionCardSideOptionLabel
source: Card Side
ru: Сторона карточки

# barScaffoldSettingsPanelContactsSectionLabel
source: Contacts
ru: Контакты

# barScaffoldSettingsPanelContactsSectionSuggestionLinkLabel
source: Send Us Your Suggestion
ru: Поделиться своим предложением

# barScaffoldSettingsPanelContactsSectionSuggestionEmailSubject
source: My Suggestion
ru: Моё предложение

# barScaffoldSettingsPanelContactsSectionSuggestionEmailBody
source: It would be great to have in Language Cards:<br>[Please, describe comprehensively how we could improve our application]
ru: Было бы здорово, если бы в Language Cards было:<br>[Пожалуйста, опишите подробно, как мы могли бы улучшить наше приложение]

# barScaffoldSettingsPanelContactsSectionBugLinkLabel
source: Report a Bug
ru: Сообщить об ошибке

# barScaffoldSettingsPanelContactsSectionBugEmailSubject
source: A Bug Has Been Detected
ru: Обнаружена ошибка

# barScaffoldSettingsPanelContactsSectionBugEmailBody
source: 1. The trouble is:<br>[Please, explain in detail what is the problem you run into. Screenshots are appreciated]<br>2. What I am doing:<br>[Please, describe comprehensively what are the actions causing the trouble]<br>3. My device and its OS version:<br>[Please, share with us the name of your smartphone and its version of Android OS]
ru: 1. Описание проблемы:<br>[Пожалуйста, опишите в деталях проблему, с которой вы столкнулись. Скриншоты очень помогут]<br>2. Что я делаю:<br>[Пожалуйста, опишите подробно ваши действия, которые приводят к ошибке]<br>3. Моё устройство и его ОС:<br>[Пожалуйста, поделитесь названием вашего смартфона и установленной на нём версией ОС Андроид]

# barScaffoldSettingsPanelHelpSectionLabel
source: Help
ru: Помощь

# barScaffoldSettingsPanelResettingButtonLabel
source: Reset
ru: Сбросить

# barScaffoldSettingsPanelApplyingButtonLabel
source: Apply
ru: Применить

# barScaffoldSettingsPanelContactsSectionReviewLinkLabel
source: Leave a Review
ru: Оставить отзыв

# cancellableDialogCancellationButtonLabel
source: Cancel
ru: Отмена

# cardEditorChoosingPackDialogTitle
source: Choose Pack
ru: Выберите набор

# cardEditorChoosingPackDialogContent
source: You should choose a pack to enable automatic translation
ru: Вам следует выбрать набор карточек, чтобы включить автоматический перевод

# cardEditorTranscriptionTextFieldLabel
source: Phonetic Notation
ru: Фонетическая нотация

# cardEditorPartOfSpeechDropdownLabel
source: Part of Speech
ru: Часть речи

# cardEditorTranslationTextFieldLabel
source: Translation
ru: Перевод

# cardEditorChoosingPackButtonLabel
source: Card Pack: {packName}
ru: Набор карточек: {packName}

# cardEditorResettingStudyProgressButtonLabel
source: Reset {studyProgress}% Progress
ru: Сбросить {studyProgress}% прогресса

# cardEditorCardTextTextFieldLabel
source: Text
ru: Текст

# cardListScreenWithoutPackTitle
source: Cards
ru: Карточки

# cardListScreenBottomNavBarResettingProgressActionLabel
source: Unlearn
ru: Разучить

# cardListScreenResettingProgressDialogTitle
source: Confirm Resetting Study Progress
ru: Подтвердить сброс прогресса обучения

# cardListScreenResettingProgressDialogContent
source: The study progress of the {cardsToResetLength} marked cards will be reset. Continue?
ru: Прогресс обучения {cardsToResetLength} отмеченных карточек будет сброшен. Продолжить?

# cardListScreenResettingProgressDialogConfirmationButtonLabel
source: Yes
ru: Да

# cardListScreenBottomSnackBarResettingProgressInfo
source: The study progress of the {cardsToResetNumber} cards has been reset
ru: Прогресс обучения {cardsToResetNumber} карточек был сброшен

# cardNumberIndicatorContent
source: Cards: {cardsNumber}
ru: Карточек: {cardsNumber}

# cardScreenHeadBarAddingCardTitle
source: Add Card
ru: Добавить карточку

# cardScreenHeadBarChangingCardTitle
source: Change Card
ru: Изменить карточку

# cardSideFrontName
source: front
ru: передняя

# cardSideBackName
source: back
ru: задняя

# cardSideRandomName
source: random
ru: случайная

# cardStudyDirectionForwardName
source: forward
ru: вперёд

# cardStudyDirectionBackwardName
source: backward
ru: назад

# cardStudyDirectionRandomName
source: random
ru: случайно

# constsSelectAll
source: Select All
ru: Выбрать все {itemsCount}

# constsUnselectAll
source: Unselect All
ru: Убрать все {itemsCount}

# constsEmptyValueValidationError
source: The field cannot be empty
ru: Поле не может быть пустым

# constsSavingItemButtonLabel
source: Save
ru: Сохранить

# constsRemovingItemButtonLabel
source: Remove
ru: Удалить

# helpScreenTitle
source: About {mainMenuItemLabel}
ru: О '{mainMenuItemLabel}'

# helpScreenPageIndicator
source: Page {pageNumber} of {pagesOverall}
ru: Страница {pageNumber} из {pagesOverall}

# helpListScreenEditorSlideDescription
source: Clicking on the pencil icon opens the editor mode for the list. Clicking there again exits the mode@Entering Editor Mode
ru: Клик по иконке карандаша откроет режим редактирования списка. Повторный клик закроет его@Режим редактирования

# helpCardScreenOverviewSlideDescription
source: The screen lists word cards across all packs or of a particular pack with its name in the title when entering here through the pack@Word Card Screen
ru: Здесь перечислены словарные карточки всех наборов либо определённого набора - его имя указано в заголовке, - если переход был выполнен из набора@Экран словарных карточек

# helpCardScreenUnlearningSlideDescription
source: {unlearningBtnLabel} zeroes the progress percentage achieved for selected cards in the study mode@Unlearning Cards
ru: '{unlearningBtnLabel}' обнуляет процент достигнутого прогресса обучения у выбранных карточек@Разучивание карточек

# helpCardScreenRemovingSlideDescription
source: {removingBtnLabel} discards selected cards. For a short period of time it is possible to recover them by clicking {undoingBtnLabel}@Removing Cards
ru: '{removingBtnLabel}' удаляет выбранные карточки. В течение краткого времени возможно восстановить удалённые карточки, нажав на '{undoingBtnLabel}'@Удаление карточек

# helpCardScreenAddingSlideDescription
source: The circular button in the bottom right corner leads to a screen for adding a new card. It is automatically added to a current pack or to the None pack if there is no pack. The pack can be changed by clicking on its name@Adding Card
ru: Круглая кнопка в нижнем правом углу ведёт к экрану добавления новой карточки. Карточка автоматически добавляется к текущему набору либо к набору '{nonePackName}', если его нет. Набор можно изменить, кликнув по его имени@Добавление карточки

# helpCardScreenWordDictionarySlideDescription
source: If there is a non-empty pack chosen for a new card, after entering its text and accepting it by the tick button on a keyboard if the text is found in a web dictionary then its possible definitions are presented to choose from@Choosing Definition
ru: После подтверждения выбора кнопкой с галочкой на клавиатуре, если текст найден в словаре, то его определения будут представлены для выбора@Выбор определения

# helpCardScreenWordTranslationSlideDescription
source: After clicking on a chosen definition all proper translations should be opted. If there are too many items in the dialog then scrolling gets available@Card Translation
ru: После клика по выбранному определению следует отметить все подходящие переводы слова. Если в диалоге слишком много записей, то его можно скроллить@Перевод карточки

# helpCardScreenSavingSlideDescription
source: Clicking the {doneBtnLabel} button fills up the card fields with chosen values. The icon with 3 dots makes possible listening to the text. The {savingBtnLabel} button saves the card into its pack@Saving Card
ru: Клик по кнопке '{doneBtnLabel}' заполнит поля карточки выбранными значениями. Иконка с 3-мя точками позволяет прослушать текст карточки. Кнопка '{savingBtnLabel}' сохранит карточку в наборе@Сохранение карточки

# helpCardScreenSearchSlideDescription
source: When there are enough cards on the screen the search mode gets available - the icon of a magnifier in the upper right corner. The mode makes it possible to filter cards by the first letter of their text@Searching for Cards
ru: Когда на экране достаточно много карточек, становится доступен режим поиска - иконка лупы в верхнем правом углу. В этом режиме можно фильтровать карточки по первой букве в их тексте@Поиск карточек

# helpPackScreenOverviewSlideDescription
source: The screen lists packs of cards showing their name, a number of their cards and translation languages@Pack Card Screen
ru: Здесь перечислены наборы словарных карточек: их имя, количество карточек и языки перевода@Экран наборов словарных карточек

# helpPackExportSlideDescription
source: {exportingBtnLabel} gets available when there is at least one pack selected. It saves all selected packs with their cards into a JSON-file so that the data could later be imported@Exporting Packs
ru: '{exportingBtnLabel}' становится доступным, если выделен хотя бы один набор. Он позволяет сохранить все выделенные наборы с их карточками в JSON-файл, из которого они могут быть позднее импортированы@Экспорт наборов

# helpPackImportSlideDescription
source: {importingBtnLabel} is available when there are no selected packs. It requires a particularly formatted JSON-file previously saved through {exportingBtnLabel}@Importing Packs
ru: '{importingBtnLabel}' доступен, когда ни один набор не выделен. В диалоге следует выбрать специально форматированный JSON-файл, ранее созданный через '{exportingBtnLabel}'@Импорт наборов

# helpPackScreenRemovingSlideDescription
source: {removingBtnLabel} discards selected packs. For a short period of time it is possible to recover them by clicking {undoingBtnLabel}@Removing Packs
ru: '{removingBtnLabel}' удаляет выбранные наборы. В течение краткого времени возможно восстановить удалённые наборы, нажав на кнопку '{undoingBtnLabel}'@Удаление наборов

# helpPackScreenCardRelocationSlideDescription
source: Accepted removal of a non-empty pack triggers the relocation of its cards into the None pack where cards without packs are stored@Removing Non-Empty Pack
ru: Подтверждённое удаление непустого набора вызовет перенос его карточек в набор '{nonePackName}', где хранятся карточки без наборов@Удаление непустого набора

# helpPackScreenAddingSlideDescription
source: The circular button in the bottom right corner leads to a screen for adding a new pack. All the fields must be filled up before saving. {savingAndAddingCardsBtnLabel} opens an empty list of cards where it is possible to add new records to the created pack@Adding Pack
ru: Круглая кнопка в нижнем правом углу ведёт к экрану добавления нового набора. Все поля на форме обязательны для заполнения перед сохранением. '{savingAndAddingCardsBtnLabel}' открывает пустой список карточек, где возможно добавить новые записи для созданного набора@Добавление набора

# helpPackScreenAmendingSlideDescription
source: Clicking on a pack opens a screen for changing its parameters. Here it is also possible to show all the pack cards by clicking on the respective icon@Amending Pack
ru: Клик на наборе откроет экран для изменения его параметров. Здесь также можно отобразить все карточки в наборе, кликнув по соответствующей иконке@Изменение набора

# helpPackScreenSearchSlideDescription
source: When there are enough packs on the screen the search mode gets available - the icon of a magnifier in the upper right corner. The mode makes it possible to filter packs by the first letter of their name@Searching for Packs
ru: Когда на экране достаточно много наборов, становится доступен режим поиска - иконка лупы в верхнем правом углу. В этом режиме можно фильтровать наборы по первой букве в их имени@Поиск наборов

# helpStudyScreenPreparationSlideDescription
source: Before studying it is necessary to choose what cards will participate in the process. It is possible to do so by selecting presented non-empty packs and then opting for a category of cards with enough number of items@Study Preparation
ru: Перед обучением необходимо выбрать, какие словарные карточки будут участвовать в процессе: отметьте представленные непустые наборы и затем выберите категорию карточек с достаточным количеством записей@Подготовка обучения

# helpStudyScreenOverviewSlideDescription
source: The screen displays each of the selected cards: their text, pack, category of study progress. Clicking on a card shows its back side with its translation. Dragging the card left or clicking on {nextCadBtnLabel} leads to a next card. {learningBtnLabel} increases its category of study progress@Study Screen
ru: Экран отображает каждую выбранную карточку: её текст, набор, категорию прогресса обучения. Клик по карточке покажет её обратную сторону с переводом. Потянув карточку влево или кликнув '{nextCadBtnLabel}' можно отобразить следующую карточку. '{learningBtnLabel}' увеличивает прогресс обучения карточки@Экран обучения

# helpStudyEditorSlideDescription
source: Clicking on the pencil icon opens the editor dialog for a card, where it is possible to change its fields and pack. The icon with 3 dots makes possible to listening to the text. The {savingBtnLabel} button saves all the changes and closes the dialog@Amending Card
ru: Клик по иконке карандаша открывает диалог редактирования карточки, где возможно изменить её поля и набор или сбросить прогресс обучения. Иконка с 3-мя точками позволяет прослушать текст карточки. Кнопка '{savingBtnLabel}' сохранит все изменения и закроет диалог@Редактирование карточки

# helpStudySettingsSlideDescription
source: How the cards are presented depends on how they are sorted ({sortingDirections}), and which of their sides is shown ({cardSides}). It is possible to change the settings by the respective buttons below. Their default values can be set up in user preferences@Study Settings
ru: Представление карточек зависит от их сортировки ({sortingDirections}) и отображаемой стороны ({cardSides}). Эти параметры могут быть изменены соответствующими кнопками внизу. Их значения по умолчанию могут быть заданы в пользовательских настройках@Параметры обучения

# importDialogTitle
source: Importing Packs
ru: Импорт наборов

# importDialogImportBtnLabel
source: Import
ru: Импорт

# importDialogFileNameTextFieldLabel
source: Import File
ru: JSON-файл импорта

# importDialogFileNameTextFieldValidationError
source: The extension of an import file must be json
ru: Расширение файла импорта должно быть json

# importDialogFileSelectorBtnLabel
source: Choose File
ru: Выбрать JSON-файл

# languageEnglishName
source: English
ru: Английский

# languageRussianName
source: Russian
ru: Русский

# listScreenBottomSnackBarRemovedItemsInfo
source: {removedItemsLength} items have been removed
ru: {removedItemsLength} записей было удалено

# listScreenBottomSnackBarUndoingActionLabel
source: Undo
ru: Восстановить

# listScreenBottomSnackBarDismissedItemInfo
source: The item {itemText} has been removed
ru: Запись {itemText} была удалена

# listScreenAddingNewItemButtonTooltip
source: New Item
ru: Новая запись

# mainScreenStudyModeMenuItemLabel
source: Study Mode
ru: Режим обучения

# mainScreenWordCardsMenuItemLabel
source: Word Cards
ru: Словарные карточки

# mainScreenWordPacksMenuItemLabel
source: Word Packs
ru: Наборы карточек

# packListScreenRemovingNonEmptyPacksDialogTitle
source: Removing Packs with Cards
ru: Удаление непустых наборов карточек

# packListScreenRemovingNonEmptyPacksDialogContent
source: All the cards from {packNames} will be moved to the {nonePackName} pack. Continue?
ru: Все карточки из наборов {packNames} будут перенесены в набор '{nonePackName}'. Продолжить?

# packListScreenTitle
source: Card Packs
ru: Наборы карточек

# packListScreenBottomNavBarExportActionLabel
source: Export
ru: Экспорт

# packListScreenBottomNavBarImportActionLabel
source: Import
ru: Импорт

# packListScreenExportDialogTitle
source: Export Status
ru: Статус экспорта

# packListScreenExportDialogContent
source: The selected packs have been saved to {filePath}
ru: Выбранные наборы сохранены в {filePath}

# packListScreenImportDialogTitle
source: Import Status
ru: Статус импорта

# packListScreenImportDialogContent
source: {packsNumber} packs and {cardsNumber} cards have been imported from {filePath}
ru: Импортировано из {filePath}: наборов - {packsNumber}, карточек - {cardsNumber}

# packListScreenImportDialogWrongFormatContent
source: Nothing has been imported: a file '{filePath}' is not found or of an incorrect format
ru: Не удалось произвести импорт: файл '{filePath}' не найден или его формат некорректный

# packScreenHeadBarAddingPackTitle
source: Add Pack
ru: Добавить набор

# packScreenHeadBarChangingPackTitle
source: Change Pack
ru: Изменить набор

# packScreenPackNameTextFieldLabel
source: Pack Name
ru: Имя набора

# packScreenTranslationFromDropdownLabel
source: Translate from
ru: Перевод с

# packScreenTranslationToDropdownLabel
source: Translate to
ru: Перевод на

# packScreenShowingCardsButtonLabel
source: Show {cardsNumber} Cards
ru: Показать карточки: {cardsNumber}

# packScreenSavingAndAddingCardsButtonLabel
source: Save and Add Cards
ru: Сохранить и добавить карточки

# packScreenSameTranslationDirectionsValidationError
source: Translation languages must differ
ru: Языки переводов должны отличаться

# packSelectorDialogTitle
source: Choose a Card Pack
ru: Выберите набор карточек

# partOfSpeechAdjectiveName
source: adjective
ru: прилагательное

# partOfSpeechAdverbName
source: adverb
ru: наречие

# partOfSpeechConjunctionName
source: conjunction
ru: союз

# partOfSpeechIdiomName
source: idiom
ru: идиома

# partOfSpeechInterjectionName
source: interjection
ru: междометие

# partOfSpeechNounName
source: noun
ru: существительное

# partOfSpeechParticipleName
source: participle
ru: причастие

# partOfSpeechPrepositionName
source: preposition
ru: предлог

# partOfSpeechPronounName
source: pronoun
ru: местоимение

# partOfSpeechVerbName
source: verb
ru: глагол

# partOfSpeechCollocationName
source: collocation
ru: выражение

# quote1
source: The limits of my language are the limits of my world.@Ludwig Wittgenstein
ru: Границы моего языка - это границы моего мира.@Людвиг Витгенштейн

# quote2
source: Live as if you were to die tomorrow. Learn as if you were to live forever.@Mahatma Gandhi
ru: Живите так, как будто ты умрёте завтра. Учитесь так, как будто ты будете жить вечно.@Махатма Ганди

# quote3
source: Language is the dress of thought.@Samuel Johnson
ru: Язык - это платье мыслей.@Сэмюэль Джонсон

# quote4
source: Develop a passion for learning. If you do, you will never cease to grow.@Anthony J. D’Angelo
ru: Развивайте страсть к обучению. Если вам это удастся, то ваше развитие никогда не остановится.@Энтони Дж. Д'Анджело

# quote5
source: Language is to the mind more than light is to the eye.@William Gibson
ru: Язык значит для ума больше, чем свет для глаза.@Уильям Гибсон

# quote6
source: Change is the end result of all true learning.@Leo Buscaglia
ru: Перемены — это конечный результат любого настоящего обучения.@Лео Бускалья

# quote7
source: Learn a language, and you’ll avoid a war.@Arab Proverb
ru: Учите язык, и вы сможете избежать войны.@Арабская пословица

# quote8
source: I am still learning.@Michelangelo
ru: Я всё ещё учусь.@Микеланджело

# quote9
source: Speak a new language so that the world will be a new world.@Rumi
ru: Научитесь говорить на новом языке, чтобы и мир стал новым.@Руми

# quote10
source: The expert in anything was once a beginner.@Anonymous
ru: Любой эксперт когда-то был начинающим.@Аноним

# quote11
source: A new language is a new life.@Persian Proverb
ru: Новый язык - это новая жизнь.@Персидская пословица

# quote12
source: A little learning is a dangerous thing.@Alexander Pope
ru: Мало знаний - это опасная вещь.@Александр Поп

# quote13
source: He who knows no foreign languages knows nothing of his own.@Johann Wolfgang von Goethe
ru: Кто не знает чужих языков, не знает ничего о своём.@Иоганн Вольфганг фон Гёте

# quote14
source: Development is a series of rebirths.@Maria Montessori
ru: Развитие - это серия перерождений.@Мария Монтессори

# quote15
source: You can never understand one language until you understand at least two.@Geoffrey Willans
ru: Вы никогда не сможете понять один язык, пока не поймёте хотя бы два.@Джеффри Вилланс

# quote16
source: Learning is a treasure that will follow its owner everywhere.@Chinese Proverb
ru: Знание - это сокровище, которое будет следовать за своим обладателем всюду.@Китайская пословица

# quote17
source: Change your language and you change your thoughts.@Karl Albrecht
ru: Измените свой язык, и вы измените свои мысли.@Карл Альбрехт

# quote18
source: Knowledge of languages is the doorway to wisdom.@Roger Bacon
ru: Знание языков - дверь к мудрости.@Роджер Бэкон

# quote19
source: Do you know what a foreign accent is? It’s a sign of bravery.@Amy Chua
ru: Знаете, что такое иностранный акцент? Это знак храбрости.@Эми Чуа

# quote20
source: Learn a new language and get a new soul.@Czech Proverb
ru: Выучите новый язык, и вы обретёте новую душу.@Чешская пословица

# quote21
source: With languages, you are at home anywhere.@Edmund De Waal
ru: Если вы знаете языки, то вы везде будете как дома.@Эдмунд дэ Вааль

# quote22
source: A man who knows two languages is worth two men.@French Proverb
ru: Человек, который говорит на двух языках, стоит двух людей.@Французская пословица

# quote23
source: A special kind of beauty exists which is born in language, of language, and for language.@Gaston Bachelard
ru: Есть особенный вид красоты, который рождается в языке, из языка и для языка.@Гастон Башляр

# quote24
source: The conquest of learning is achieved through the knowledge of languages.@Roger Bacon
ru: Победа познания достигается через знание языков.@Роджер Бэкон

# quote25
source: The whole purpose of education is to turn mirrors into windows.@Sydney J. Harris
ru: Общая цель образования - это превращение зеркал в окна.@Сидни Дж. Харрис

# quote26
source: Language is wine upon the lips.@Virginia Woolf
ru: Язык - это вино на губах.@Вирджиния Вульф

# quote27
source: If you want people to understand you, you speak their language.@African Proverb
ru: Если вы хотите, чтобы люди вас понимали, вам следует говорить на их языке.@Африканская пословица

# speakerButtonUnaivailableTTSDialogTitle
source: Text to Speech Is Unavailable
ru: Озвучивание текста отсутствует

# speakerButtonUnaivailableTTSDialogContent
source: The language {language} is absent. Try installing it in the settings of your device
ru: Язык {language} отсутствует. Попробуйте установить его в настройках вашего устройства

# storedPackNonePackName
source: None
ru: Без набора

# studyPreparerScreenTitle
source: Card Categories for Study
ru: Категории для учёбы

# studyPreparerScreenAllCardsCategoryName
source: All
ru: Все

# studyScreenEditingCardDialogTitle
source: Change Card
ru: Изменить карточку

# studyScreenStudyEndDialogTitle
source: The Study Cycle Is Over
ru: Цикл обучения закончен

# studyScreenStudyEndDialogContent
source: Well Done! You have finished the study. You can repeat the study to hone the cards to perfection
ru: Так держать! Обучение успешно завершено. Вы можете пройти его повторно, чтобы отточить знания до совершенства

# studyScreenTitle
source: {curCardIndex} of {cardsNumber} Cards
ru: Карточка {curCardIndex} из {cardsNumber}

# studyScreenLearningCardButtonLabel
source: Learn
ru: Выучить

# studyScreenNextCardButtonLabel
source: Next
ru: Следующая
