Repository: Jahn08/language_cards
Catalog: lib/l10n/app_*.arb
Languages: ru

# studyScreenSortingCardButtonLabel
source: Sorting: {studyDirection}
ru: Сортировка: {studyDirection}

# studyScreenCardSideButtonLabel
source: Side: {cardSide}
ru: Сторона: {cardSide}

# translationSelectorDialogTitle
source: Select Translations
ru: Выберите перевод

# translationSelectorDoneButtonLabel
source: Done
ru: Принять

# wordSelectorDialogTitle
source: Choose a Word Definition
ru: Выберите определение слова

# wordStudyStageNewStageName
source: New
ru: Новые

# wordStudyStageFamiliarStageName
source: Familiar
ru: Знакомые

# wordStudyStageWellKnownStageName
source: Well Known
ru: Хорошо знакомые

# wordStudyStageLearnedStageName
source: Learned
ru: Выученные
